#1. Сформувати функцію для введення з клавіатури послідовності чисел і виведення
#її на екран у зворотному порядку (завершаючий символ послідовності – крапка)

import timeit

n=input('Введіть послідовнсть чисел: ')

#Ітераційне рішення:
def reverse_digit(k):
    if k=='':
        return 0
    else:
        r=k[::-1]
    return r + '.'

print('Послідовність чисел у зворотньому порядку: ', reverse_digit(n))
t=timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print('Час виконання: ', t)
print()


x=input('Знову введіть послідовність чисел: ')

#Рекурсивне рішення.
def rev_rec(m):
    if len(m) == 1:
        return m
    return m[-1] + rev_rec(m[:-1])

print('Послідовність чисел у зворотьому порядку: ', rev_rec(x)+'.')
v=timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print('Час виконання: ', v)

#У даному випадку ітераційний розв'зок задачі потужніший та швидший, аніж
#рекурсивний. Тому ітераційне рішення більш доречно вживати до даної задачі.



        
