#2. Сформувати функцію, що визначатиме чи є задане натуральне число простим.
#Простим називається число, що більше за 1 та не має інших дільників, окрім 1 та самого
#себе).

x=int(input('Введіть будь-яке число: '))

#Ітераційний розв'зок задачі.
def simple_digit(n):
    div = 2
    while n % div!=0:
        div += 1
    return div == n

print('Число, просте, якщо True, якщо False - ні: ', simple_digit(x))


y=int(input('Знову введіть якесь число: '))

#Рекурсивний розв'зок задачі.
def simple_digit_rec(n, div=3):
    if n < 2 or n!=2 and n & 1 == 0:
        return False
    if div * div> n:
        return True
    return n % div and simple_digit_rec(n, div + 2)

print('Число, просте, якщо True, якщо False - ні: ', simple_digit_rec(y))


#Ітераційний розв'зок у даному випадку кращий, тому що у ньому ми використовуємо
#меншу кількість порінянь та перевірок. Тому для даної задачі більш доречно
#уде використати ітераційний розв'зок, аніж рекурсивний.
